[
    {
        "header": "Composite Restoration",
        "serviceName": "Composite Restoration Services You Can Trust",
        "img": "https://www.clearlakesdental.com/wp-content/uploads/2018/11/banner1-01-3-1024x394.jpg",
        "price": 250,
        "ratings": 4,
        "description": "Sometimes, when you have tooth decay or a chipped tooth, composite restoration is necessary for maintaining your smile and oral health. If you have major tooth decay or a broken/chipped tooth, don’t hesitate to make an appointment with your local dentist in St Paul at Clear Lakes Dental. We will be happy to do your composite restoration for you. Composite fillings are tooth-colored restorations used to replace parts of a tooth that are damaged, missing, or decayed. Composite restoration is the most common type of dental restoration used because it looks and wears like natural teeth, ensuring that you will have a healthy and beautiful smile.",
        "benefitName": "Regain Your Healthy Smile",
        "benefitDetails": "If you’re looking to get a composite restoration done for your teeth, feel free to contact your local St Paul dentist at Clear Lakes Dental. At Clear Lakes Dental, you can expect quality care from our friendly staff, and for us to always put your well-being first. S Contact Clear Lakes Dental today to schedule an appointment. We proudly serve patients from St Paul MN and the surrounding areas.",
        "reviews": [
            {
                "name": "Korim",
                "email": "korim@gmail.com",
                "rates": 5,
                "review": "“Staff is great and friendly. Any work I’ve had done I’ve been very pleased with. This dentist office is awesome.”"
            },
            {
                "name": " Siobhan P.",
                "email": "siobhan@gmail.com",
                "rates": 5,
                "review": "“After a bad experience at a different dental office, Clear Lakes Dental fixed it all painlessly, and provided a great experience!”"
            }
        ]
    },
    {
        "header": "Dental Bridges",
        "serviceName": "Knowledgeable Porcelain Teeth Bridge Dentists",
        "img": "https://www.clearlakesdental.com/wp-content/uploads/2018/11/banner2-01-3-1024x394.jpg",
        "price": 150,
        "ratings": 5,
        "description": "A dental bridge is a non-removable appliance used to replace missing or lost teeth. Though there are several types of bridges available, porcelain fixed bridges are favored by many patients because of their ability to replicate the look of your natural teeth. These appliances fill the gap created by one or more missing teeth. It consists of two crowns that go over two abutment teeth that are attached to an artificial tooth. Together, this grouping perfectly fills the gap of your missing teeth to provide you with a complete smile once again. At Clear Lakes Dental, our porcelain teeth bridge dentists in St Paul, MN are prepared to return your smile with a unique restoration that perfectly mimics the look of your real teeth. Reach out to our knowledgeable dental team for more information about our porcelain teeth bridges.",
        "benefitName": "Reasons You May Need a Porcelain Tooth Bridge",
        "benefitDetails": "The team at our dedicated dental practice is committed to restoring the beauty and functionality of our patients’ teeth and smiles. Whether used in tandem with crowns or as a standalone replacement, porcelain dental bridges offer a number of benefits, some of which include:Filling the Space Of Missing Teeth Maintaining Facial Shape and Structure Preventing Remaining Teeth From Moving Out Of Position Restoring Masticatory Functions and Speaking Ability Restoring Your Smile Not only can fixed dental bridges help restore missing teeth, but they also help to improve the aesthetics of your natural teeth and give your face a more full appearance. Talk to our skilled porcelain tooth bridge dentists to determine your best course of action regarding your treatment. Schedule an appointment with our dental bridge dentists today. We proudly serve patients in St Paul, MN, and the surrounding areas.",
        "reviews": [
            {
                "name": "Lance H.",
                "email": "lance@gamil.com",
                "rates": 5,
                "review": "“From the welcoming waiting room to the friendly, responsive and competent team, our family is very happy with Clear Lakes. We highly recommend Clear Lakes.”"
            },
            {
                "name": " Siobhan P",
                "email": "siobhan@gamil.com",
                "rates": 5,
                "review": "“After a bad experience at a different dental office, Clear Lakes Dental fixed it all painlessly, and provided a great experience!”"
            }
        ]
    },
    {
        "header": "Teeth Extration",
        "serviceName": "Extractions Delivered with Care and Compassion",
        "img": "https://www.clearlakesdental.com/wp-content/uploads/2018/11/banner8-01-1-1024x394.jpg",
        "price": 75,
        "ratings": 5,
        "description": "Although permanent teeth are meant to last a lifetime, there are a number of reasons that you may need to have a tooth pulled in adulthood. Generally, dentists take a proactive approach to a patient’s oral health needs in order to prevent the need for a tooth extraction. However, when a tooth becomes badly damaged due to drama or decay, seeking an extraction is often the best course of action. At Clear Lakes Dental, our affordable wisdom teeth removal dentists in St Paul, MN, perform effective and efficient extractions for less. Whether you have an impacted, infected or fractured wisdom tooth, count on our dedicated dental team to handle your needs with the utmost care. Contact our tooth removal dentists for more information about our procedures.",
        "benefitName": "Although permanent teeth are meant to last a lifetime, there are a number of reasons that you may need to have a tooth pulled in adulthood. Generally, dentists take a proactive approach to a patient’s oral health needs in order to prevent the need for a tooth extraction. However, when a tooth becomes badly damaged due to drama or decay, seeking an extraction is often the best course of action. At Clear Lakes Dental, our affordable wisdom teeth removal dentists in St Paul, MN, perform effective and efficient extractions for less. Whether you have an impacted, infected or fractured wisdom tooth, count on our dedicated dental team to handle your needs with the utmost care. Contact our tooth removal dentists for more information about our procedures.",
        "benefitDetails": "Wisdom teeth don’t always have to cause pain to set the stage for future dental problems. The movement of surrounding teeth caused by emerging wisdom teeth is often slow and may not induce any pain. However, if you or a family member has had braces or some other orthodontic treatment, crowding from wisdom teeth can potentially undo that work. When you visit our office, depending on your individual needs, we may recommend removing some or all of your wisdom teeth to help alleviate any current pain. Additionally, we may also recommend removing problem wisdom teeth sooner rather than later to avoid future complications that could result in a dental emergency. Allow our skilled team to determine the position of your wisdom teeth and the type of extraction that best serves your needs. Schedule an appointment with our dental office today and be step closer to ending your wisdom tooth pain. Contact our tooth removal dentists to determine if an extraction is necessary. We proudly serve patients of all ages in St Paul, MN, and the surrounding areas. ",
        "reviews": [
            {
                "name": "Eric",
                "email": "eric@gmail.com",
                "rates": 5,
                "review": "“Staff is great and friendly. Any work I’ve had done I’ve been very pleased with. This dentist office is awesome.”"
            },
            {
                "name": "Alim",
                "email": "alim@gmail.com",
                "rates": 5,
                "review": "“From the welcoming waiting room to the friendly, responsive and competent team, our family is very happy with Clear Lakes. We highly recommend Clear Lakes.”"
            }
        ]
    },
    {
        "header": "Root Canals",
        "serviceName": "Saving a Tooth From Being Pulled",
        "img": "https://www.clearlakesdental.com/wp-content/uploads/2021/02/Protect-your-smile-with-1536x591.png",
        "price": 420,
        "ratings": 5,
        "description": "Saving the natural tooth is always a wise decision. Root canal treatment helps to keep your natural smile, continue to eat your usual diet, and avoid ongoing dental work. A tooth that has received a root canal treatment can last a lifetime if taken care of properly. Our expert dentists will use local anesthesia to numb your tooth and gums, making sure you are comfortable the whole time. With the modern technology available to us today, a root canal is typically very similar to having a deep filling done.",
        "benefitName": "Saving the natural tooth is always a wise decision. Root canal treatment helps to keep your natural smile, continue to eat your usual diet, and avoid ongoing dental work. A tooth that has received a root canal treatment can last a lifetime if taken care of properly. Our expert dentists will use local anesthesia to numb your tooth and gums, making sure you are comfortable the whole time. With the modern technology available to us today, a root canal is typically very similar to having a deep filling done.",
        "benefitDetails": "When the soft tissue inside your tooth (the pulp) becomes infected or inflamed, a root canal treatment is needed. Here is a list of reasons why you may need a root canal treatment: If left untreated, you may experience persistent pain &/or an abscess as a result. The term root canal can sound scary to a lot of people. However, the procedure itself doesn’t cause any kind of special pain and is actually the solution to those experiencing persistent tooth pain. Almost all patients report feeling better shortly after a root canal treatment. Schedule an appointment with our root canal dentists today. We proudly serve patients in St Paul, MN, and the surrounding areas.",
        "reviews": [
            {
                "name": "Rahim",
                "email": "rahim@gmail.com",
                "rates": 5,
                "review": "“From the welcoming waiting room to the friendly, responsive and competent team, our family is very happy with Clear Lakes. We highly recommend Clear Lakes.”"
            },
            {
                "name": "Alim",
                "email": "alim@gmail.com",
                "rates": 5,
                "review": "“From the welcoming waiting room to the friendly, responsive and competent team, our family is very happy with Clear Lakes. We highly recommend Clear Lakes.”"
            }
        ]
    },
    {
        "header": "Dental Cronwns",
        "serviceName": "Protect & Enhance Your Smile",
        "img": "https://www.clearlakesdental.com/wp-content/uploads/2018/11/banner3-01-2-1024x394.jpg",
        "price": 50,
        "ratings": 5,
        "description": "Over time, teeth inevitably weaken and begin to need extra protection. Ensure that your smile remains vibrant by coming to Clear Lakes Dental in St Paul, MN, to be professionally fitted for tooth crowns. With us, you’ll be able to repair and protect your teeth against numerous problems, such as cracks, decay, infections, and more. Our office is committed to making sure all your teeth remain healthy and strong for a lifetime. Schedule an appointment with us today if you experience any of the following issues with your teeth:Discoloration",
        "benefitName": "Beautiful Looking Crowns",
        "benefitDetails": "Everyone desires a gorgeous row of straight teeth, but metal caps do little more than distract from a smile. That is why we offer a variety of natural-looking crowns that blend perfectly and even enhance the look of your smile. This is the perfect option for those who want to show off their pearly whites whenever they desire. Porcelain, ceramic, and synthetic caps not only look great, but they also feel no different than your natural teeth. Get in touch with our office today to go over your options for protecting your teeth with natural-looking tooth crowns. Contact us today to find out more about the procedure of implanting tooth crowns. We are proud to serve St Paul, MN, and the surrounding area. Dental Crow",
        "reviews": [
            {
                "name": "Rahim",
                "email": "rahim@gmail.com",
                "rates": 5,
                "review": "“From the welcoming waiting room to the friendly, responsive and competent team, our family is very happy with Clear Lakes. We highly recommend Clear Lakes.”"
            },
            {
                "name": "Alim",
                "email": "alim@gmail.com",
                "rates": 5,
                "review": "“From the welcoming waiting room to the friendly, responsive and competent team, our family is very happy with Clear Lakes. We highly recommend Clear Lakes.”"
            }
        ]
    },
    {
        "header": "Dentures",
        "serviceName": "Natural Looking and Attractive Dentures",
        "img": "https://www.clearlakesdental.com/wp-content/uploads/2018/11/banner4-01-2-1024x394.jpg",
        "price": 25,
        "ratings": 4.5,
        "description": "Improve your bite, as well as your quality of life, with dental dentures. In St Paul, MN, we are highly experienced dentists who understand the structure of your mouth and how to create perfect and comfortable-fitting dentures. When you have missing teeth, it can be hard to eat or smile. The health of your mouth and remaining teeth will also be affected. Depend on Clear Lakes Dental for a natural-looking smile and strong teeth. Contact us for a consultation today.",
        "benefitName": "The Benefits of Full and Partial Dentures",
        "benefitDetails": "Missing teeth prevent you from properly performing basic oral functions. Speaking and chewing are also difficult, even with one missing tooth. In addition, it diminishes your quality of life. However, dental dentures restore your oral capabilities and even have the same texture and color of real teeth. You don’t have to suffer with missing teeth. With dentures, we give you the opportunity to enjoy life as it once was. In addition, failure to replace missing teeth can lead to a number of dental difficulties, including an improper bite that impacts your ability to speak and chew normally. There are a number of reasons why patients come to us for dentures. They include: Enhanced Self-Confidence Improved Appearance Improved Speech Ability to Eat the Foods They Love Prevention of Teeth Movement Prevention of Facial and Jaw Changes Lowered Risk of Periodontal Disease Reduced Stress on Jaw Improved Confidence and Your Bite Restore your confidence and your smile by contacting us about full and partial dentures. We proudly serve patients in St Paul, MN, and the surrounding areas. Dentures St Paul MN Dentures St Paul MN Dentures St Paul MN Dentures St Paul MN Dentures St Paul MN Dentures St Paul MN",
        "reviews": [
            {
                "name": " Siobhan P",
                "email": "siobhan@gamil.com",
                "rates": 5,
                "review": "“After a bad experience at a different dental office, Clear Lakes Dental fixed it all painlessly, and provided a great experience!”"
            },
            {
                "name": "Lance H.",
                "email": "lance@gamil.com",
                "rates": 5,
                "review": "“From the welcoming waiting room to the friendly, responsive and competent team, our family is very happy with Clear Lakes. We highly recommend Clear Lakes.”"
            }
        ]
    }
]